import { Box, Typography } from "@mui/material";
import { useUser } from "../../authentication/useUser";

export default function Biography() {
  const { user } = useUser();

  return (
    <Box>
      <Typography variant="h5">Кратка биографија</Typography>
      <Typography variant="body2" sx={{ py: 5 }}>
        Јас сум {user?.user_metadata?.name}, искусен HR регрутер со над 10
        години работно искуство во полето на човечките ресурси. Својата кариера
        ја започнав како помлад HR асистент и со текот на годините напредував,
        стекнувајќи богато знаење и вештини во регрутирањето и управувањето со
        таленти. Позната сум по мојот професионализам, одлична комуникација и
        способност да пронајдам и привлечам врвни таленти за различни индустрии.
        Работев со големи компании, помагајќи им да изградат силни и ефикасни
        тимови. Со посветеност кон мојата професија и постојана желба за
        усовршување, се стремам да бидам лидер и ментор во областа на HR.
      </Typography>
    </Box>
  );
}
